conf/src/Catalogs/ЭП_КлассификаторЦветов/ЭП_КлассификаторЦветов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭП_КлассификаторЦветов</name>
  <attributes>
    <name>Красный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Зеленый</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Синий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

conf/src/Catalogs/ЭП_КлассификаторЦветов/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ) 
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ЭтоНовый() Тогда
			
		Запрос = Новый Запрос; 
		Запрос.УстановитьПараметр("Наименование", ЭтотОбъект.Наименование);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭП_КлассификаторЦветов.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ЭП_КлассификаторЦветов КАК ЭП_КлассификаторЦветов
		|ГДЕ
		|	ЭП_КлассификаторЦветов.Наименование = &Наименование";
		 
		РезультатЗапроса = Запрос.Выполнить();  
		
		Если Не РезультатЗапроса.Пустой() Тогда
			ТекстСообщения = "Цвет с таким наименование уже существует!";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
 
		Запрос.УстановитьПараметр("Красный", ЭтотОбъект.Красный);
		Запрос.УстановитьПараметр("Зеленый", ЭтотОбъект.Зеленый);
		Запрос.УстановитьПараметр("Синий", ЭтотОбъект.Синий);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭП_КлассификаторЦветов.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ЭП_КлассификаторЦветов КАК ЭП_КлассификаторЦветов
		|ГДЕ
		|	ЭП_КлассификаторЦветов.Красный = &Красный
		|	И ЭП_КлассификаторЦветов.Зеленый = &Зеленый
		|	И ЭП_КлассификаторЦветов.Синий = &Синий";
		 
		РезультатЗапроса = Запрос.Выполнить();  
		
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать(); 
			Выборка.Следующий();
			ТекстСообщения = "Такой цвет уже существует под названием """ + Выборка.Наименование + """!";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Отказ = Истина;
			Возврат;
		КонецЕсли;

		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
